const Description: React.FC = (): React.ReactElement => {
  return (
    <div
      className="mb-4 mt-8 rounded-lg bg-success-100 text-base text-success-700"
      role="alert"
    >
      <h4 className="mb-2 text-2xl font-medium leading-tight">
        لیست قیمت لوله مانیسمان اهواز
      </h4>
      <p className="mb-4">
        شما میتوانید با شماره تلفن پایپ کالا 6808-5569-021 برای دریافت جدیدترین
        قیمت لوله مانیسمان اهواز به همراه تخفیف ویژه تماس بگیرید. همچنین امکان
        ثبت پیش فاکتور آنلاین در لیست قیمت پایین وجود دارد و مشخصات فنی این
        محصول به صورت کامل در انتهای لیست قابل مشاهده است.
      </p>
      <hr className="border-success-600 opacity-30" />
      <p className="mt-4 mb-0">
        لوله مانیسمان نوعی از لوله فلزی می باشد که دارای روش ساخت منحصر به فرد
        خود می باشد ، در ساخت لوله مانیسمان از هیچ گونه درز جوشی در راستای لوله
        استفاده نمی شود و به همین علت لوله های مانیسمان فشار و دمای بسیار بالایی
        را تحمل می کنند .
      </p>
      <p className="mt-4 mb-0">
        لوله مانیسمان اهواز با آلیاژ جنس کربن استیل (Carbon Steel) که طبق
        استاندارد ASTM A106 , APIL 5L , ASTM A53 می باشدتولید می شود که روش ساخت
        آن دقیقا مشابه استانداردهای جهانی می باشد. شرکت نورد و لوله اهواز در سال
        1346 و به منظور تولید انواع لوله های سیاه، لوله های گالوانیزه و ...
        تاسیس و اندکی بعد مورد بهره برداری قرار گرفت. این شرکت دارای 4 کارخانه
        تولید لوله و 3 کارخانه پوشش دهی لوله است. این کارخانه ها انواع لوله های
        فلزی را از سایز1 الی 6 اینچ تولید می کنند.
      </p>
    </div>
  );
};

export default Description;
