"use client";

import { usePathname } from "next/navigation";
import { Breadcrumbs } from "ui";
import ByBrands from "./ByBrands";
import ByGrouping from "./ByGrouping";

const ProductGrouping: React.FC = (): React.ReactElement => {
  const pathname = usePathname();

  return (
    <section>
      <div className="container px-3 mx-auto">
        <Breadcrumbs pathname={pathname as string} />
        <div>
          <h3>بر اساس دسته بندی</h3>
        </div>
        <ByGrouping />
        <div>
          <h3>بر اساس برند</h3>
        </div>
        <ByBrands />
        <hr />
        <div className="mt-4 text-justify">
          <p>
            لوله‌ها، استوانه‌هایی تو خالی هستند که برای انتقال سیالات در بسیاری
            از صنایع، کاربرد دارند. مردم هزاران سال است که از لوله‌ها برای اهداف
            مختلف استفاده و تولید می‌کنند. شواهد باستان شناسی تأیید می‌کند که
            حتی در سال 2000 قبل از میلاد، کشاورزان باستانی، از جمله مردم چین از
            لوله‌های ساخته شده از مواد مختلف مانند بامبو یا انواع دیگر چوب، برای
            انتقال آب استفاده می‌کردند. امروزه نیز لوله‌ها از مواد مختلفی تولید
            می‌شوند. لوله فلزی یکی از پراستفاده‌ترین انواع لوله در جهان است. از
            دهه 1800، پیشرفت‌های شگرفی در فناوری لوله‌های فلزی، انجام شده است.
            بهبود روش‌های ساخت، توسعه برنامه‌های کاربردی برای استفاده از آن‌ها و
            ایجاد مقررات و استانداردها، از جمله این اقدامات است.
          </p>
          <h3 className="mt-5 mb-3">لوله فلزی چیست؟</h3>
          <p>
            همانطور که پیش‌تر نیز بیان شد، لوله فلزی، استوانه‌ای توخالی برای
            انتقال مواد سیال قابل جریان، ذرات جامد کوچک و گازها هستند. لوله‌های
            فلزی، اغلب از جنس فولادی هستند که بادوام است. به همین دلیل در
            سیستم‌های آب، گاز، گرمایش و لوله‌کشی شهری و همچنین در وسایل روزمره
            مانند اتومبیل، میله پرچم، چراغ خیابان و یخچال استفاده می‌شوند. به
            طور مشابه، لوله‌های فولادی اغلب توسط صنعت ساخت و ساز در کشتی سازی،
            معماری، پالایشگاه‌های نفت و غیره نیز مورد استفاده قرار می‌گیرد.
            لوله‌های فولادی، به دلیل تطبیق‌پذیری با شرایط مختلف، متداول‌تر از
            سایر لوله‌ها هستند؛ به طوری که سالانه میلیون‌ها تن لوله فولادی در
            سرتاسر جهان تولید و فروخته می‌شود.
          </p>
          <h3 className="mt-5 mb-3">نکات مهم هنگام خرید لوله آهنی</h3>
          <p>
            در هنگام خرید انواع لوله و اتصالات لازم است تا به نکات زیر توجه
            کنید:
          </p>
          <ul className="list-decimal pr-4 mt-3">
            <li>
              از کیفیت ساخت و متریال لوله فلزی مطمئن شوید. استفاده از لوله
              بی‌کیفیت، عمر پروژه را کوتاه می‌کند و باعث بالاتر رفتن هزینه تعمیر
              و نگهداری می‌شود.
            </li>
            <li>
              برای خرید لوله با کیفیت و مطمئن، از فروشگاه‌هایی که سابقه طولانی
              در این عرصه دارند کمک بگیرید.
            </li>
            <li>
              پیش از خرید، از ویژگی محصولات مورد نظر خود مطمئن شوید تا انتخاب
              درستی داشته باشید. هر لوله فلزی کاربرد خاص خود را دارد. بنابراین
              نمی‌توان از یک نوع لوله در تمامی پروژه‌ها استفاده کرد.
            </li>
            <li>
              قبل از اینکه خرید خود را نهایی کنید، با کارشناسان ما مشورت کنید.
            </li>
          </ul>
        </div>
      </div>
    </section>
  );
};

export default ProductGrouping;
